/**
 *  @file       types.h
 *  @brief      Shared definitions for the MathKong library.
 *  @author     Ash Vardanian
 *  @date       October 2, 2023
 *
 *  Defines:
 *  - Sized aliases for numeric types, like: `mathkong_i32_t` and `mathkong_f64_t`.
 *  - Macros for internal compiler/hardware checks, like: `_MATHKONG_TARGET_ARM`.
 *  - Macros for feature controls, like: `MATHKONG_TARGET_NEON`
 */
#ifndef MATHKONG_TYPES_H
#define MATHKONG_TYPES_H

// Inferring target OS: Windows, macOS, or Linux
#if defined(WIN32) || defined(_WIN32) || defined(__WIN32__) || defined(__NT__)
#define _MATHKONG_DEFINED_WINDOWS 1
#elif defined(__APPLE__) && defined(__MACH__)
#define _MATHKONG_DEFINED_APPLE 1
#elif defined(__linux__)
#define _MATHKONG_DEFINED_LINUX 1
#endif

// Annotation for the public API symbols:
//
// - `MATHKONG_PUBLIC` is used for functions that are part of the public API.
// - `MATHKONG_INTERNAL` is used for internal helper functions with unstable APIs.
// - `MATHKONG_DYNAMIC` is used for functions that are part of the public API, but are dispatched at runtime.
//
// On GCC we mark the functions as `nonnull` informing that none of the arguments can be `NULL`.
// Marking with `pure` and `const` isn't possible as outputting to a pointer is a "side effect".
#if defined(_WIN32) || defined(__CYGWIN__)
#define MATHKONG_DYNAMIC __declspec(dllexport)
#define MATHKONG_PUBLIC inline static
#define MATHKONG_INTERNAL inline static
#elif defined(__GNUC__) || defined(__clang__)

#if !defined(MATHKONG_NATIVE_BF16) || MATHKONG_NATIVE_BF16
/**
 *  @brief  Half-precision brain-float type.
 *
 *  - GCC or Clang on 64-bit Arm: `__bf16`
 *  - GCC or Clang on 64-bit x86: `_BFloat16`.
 *  - Default: `unsigned short`.
 *
 *  The compilers have added `__bf16` support in compliance with the x86-64 psABI spec.
 *  The motivation for this new special type is summed up as:
 *
 *      Currently `__bfloat16` is a typedef of short, which creates a problem where the
 *      compiler does not raise any alarms if it is used to add, subtract, multiply or
 *      divide, but the result of the calculation is actually meaningless.
 *      To solve this problem, a real scalar type `__Bfloat16` needs to be introduced.
 *      It is mainly used for intrinsics, not available for C standard operators.
 *      `__Bfloat16` will also be used for movement like passing parameter, load and store,
 *      vector initialization, vector shuffle, and etc. It creates a need for a
 *      corresponding psABI.
 *
 *  @warning Apple Clang has hard time with bf16.
 *  https://developer.apple.com/documentation/xcode/writing-arm64-code-for-apple-platforms
 *  https://forums.developer.apple.com/forums/thread/726201
 *  https://www.phoronix.com/news/GCC-LLVM-bf16-BFloat16-Type
 */
#if (defined(__GNUC__) || defined(__clang__)) && (defined(__ARM_ARCH) || defined(__aarch64__)) && \
    (defined(__ARM_BF16_FORMAT_ALTERNATIVE))
#undef MATHKONG_NATIVE_BF16
#define MATHKONG_NATIVE_BF16 1
typedef __bf16 mathkong_bf16_t;
#elif ((defined(__GNUC__) || defined(__clang__)) && (defined(__x86_64__) || defined(__i386__)) && \
       (defined(__AVX512BF16__)))
typedef __bfloat16 mathkong_bf16_t;
#undef MATHKONG_NATIVE_BF16
#define MATHKONG_NATIVE_BF16 1
#else                                       // Unknown compiler or architecture
#if defined(__GNUC__) || defined(__clang__) // Some compilers don't support warning pragmas
#warning "Unknown compiler or architecture for bfloat16."
#endif
#undef MATHKONG_NATIVE_BF16
#define MATHKONG_NATIVE_BF16 0
#endif // Unknown compiler or architecture
#endif // !MATHKONG_NATIVE_BF16

#if !MATHKONG_NATIVE_BF16
typedef unsigned short mathkong_bf16_t;
#endif

/**
 *  @brief  Alias for the half-precision floating-point type on Arm.
 *
 *  Clang and GCC bring the `float16_t` symbol when you compile for Aarch64.
 *  MSVC lacks it, and it's `vld1_f16`-like intrinsics are in reality macros,
 *  that cast to 16-bit integers internally, instead of using floats.
 *  Some of those are defined as aliases, so we use `#define` preprocessor
 *  directives instead of `typedef` to avoid errors.
 */
#if _MATHKONG_TARGET_ARM
#if defined(_MSC_VER)
#define mathkong_f16_for_arm_simd_t mathkong_f16_t
#define mathkong_bf16_for_arm_simd_t mathkong_bf16_t
#else
#define mathkong_f16_for_arm_simd_t float16_t
#define mathkong_bf16_for_arm_simd_t bfloat16_t
#endif
#endif

/*
 *  Let's make sure the sizes of the types are as expected.
 *  In C the `_Static_assert` is only available with C11 and later.
 */
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_b8_t) == 1, mathkong_b8_t_must_be_1_byte);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_i4x2_t) == 1, mathkong_i4x2_t_must_be_1_byte);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_i8_t) == 1, mathkong_i8_t_must_be_1_byte);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_u8_t) == 1, mathkong_u8_t_must_be_1_byte);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_i16_t) == 2, mathkong_i16_t_must_be_2_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_u16_t) == 2, mathkong_u16_t_must_be_2_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_i32_t) == 4, mathkong_i32_t_must_be_4_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_u32_t) == 4, mathkong_u32_t_must_be_4_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_i64_t) == 8, mathkong_i64_t_must_be_8_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_u64_t) == 8, mathkong_u64_t_must_be_8_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_f32_t) == 4, mathkong_f32_t_must_be_4_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_f64_t) == 8, mathkong_f64_t_must_be_8_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_f16_t) == 2, mathkong_f16_t_must_be_2_bytes);
_MATHKONG_STATIC_ASSERT(sizeof(mathkong_bf16_t) == 2, mathkong_bf16_t_must_be_2_bytes);

/** @brief  Convenience type for single- and half-precision floating-point type conversions. */
typedef union {
    mathkong_f32_t f;
    mathkong_u32_t u;
    mathkong_i32_t i;
} mathkong_fui32_t;

/** @brief  Convenience type for double-precision floating-point type conversions. */
typedef union {
    mathkong_f64_t f;
    mathkong_u64_t u;
    mathkong_i64_t i;
} mathkong_fui64_t;

/** @brief  Convenience type addressing the real and imaginary parts of a half-precision complex number. */
typedef struct {
    mathkong_f16_t real;
    mathkong_f16_t imag;
} mathkong_f16c_t;

/** @brief  Convenience type addressing the real and imaginary parts of a half-precision brain-float complex number. */
typedef struct {
    mathkong_bf16_t real;
    mathkong_bf16_t imag;
} mathkong_bf16c_t;

/** @brief  Convenience type addressing the real and imaginary parts of a single-precision complex number. */
typedef struct {
